ARMmbed/mbed-os/targets/TARGET_Maxim/TARGET_MAX32670/Libraries/CMSIS/Device/Maxim/MAX32670/Include/max32670.h
/*******************************************************************************
 * Copyright (C) 2022 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 *
 ******************************************************************************/
#ifndef _MAX32670_REGS_H_
#define _MAX32670_REGS_H_

#ifndef TARGET_NUM
#define TARGET_NUM  32670
#endif 

#define MXC_NUMCORES 1

#include <stdint.h>

#ifndef  FALSE
#define  FALSE      (0)
#endif

#ifndef  TRUE
#define  TRUE       (1)
#endif

/* COMPILER SPECIFIC DEFINES (IAR, ARMCC and GNUC) */
#if defined ( __GNUC__ )
#define __weak __attribute__((weak))

#elif defined ( __CC_ARM)
 
#define inline __inline
#pragma anon_unions

#endif

typedef enum {
    NonMaskableInt_IRQn    = -14,
    HardFault_IRQn         = -13,
    MemoryManagement_IRQn  = -12,
    BusFault_IRQn          = -11,
    UsageFault_IRQn        = -10,
    SVCall_IRQn            = -5,
    DebugMonitor_IRQn      = -4,
    PendSV_IRQn            = -2,
    SysTick_IRQn           = -1,

    /* Device-specific interrupt sources (external to ARM core)                 */
    /*                      table entry number                                  */
    /*                      ||||                                                */
    /*                      ||||  table offset address                          */
    /*                      vvvv  vvvvvv                                        */

    PF_IRQn = 0,            /* 0x10  0x0040  16: Power Fail */
    WDT0_IRQn,              /* 0x11  0x0044  17: Watchdog 0 */
    RSV02_IRQn,             /* 0x12  0x0048  18: Reserved */
    RTC_IRQn,               /* 0x13  0x004C  19: RTC */
    TRNG_IRQn,              /* 0x14  0x0050  20: True Random Number Generator */
    TMR0_IRQn,              /* 0x15  0x0054  21: Timer 0 */
    TMR1_IRQn,              /* 0x16  0x0058  22: Timer 1 */
    TMR2_IRQn,              /* 0x17  0x005C  23: Timer 2 */
    TMR3_IRQn,              /* 0x18  0x0060  24: Timer 3 */
    TMR4_IRQn,              /* 0x19  0x0064  25: Timer 4 */
    TMR5_IRQn,              /* 0x1A  0x0068  26: Timer 5 */
    RSV11_IRQn,             /* 0x1B  0x006C  27: Reserved */
    RSV12_IRQn,             /* 0x1C  0x0070  28: Reserved */
    I2C0_IRQn,              /* 0x1D  0x0074  29: I2C0 */
    UART0_IRQn,             /* 0x1E  0x0078  30: UART 0 */
    UART1_IRQn,             /* 0x1F  0x007C  31: UART 1 */
    SPI0_IRQn,              /* 0x20  0x0080  32: SPI0 */
    SPI1_IRQn,              /* 0x21  0x0084  33: SPI1 */
    SPI2_IRQn,              /* 0x22  0x0088  34: SPI2 */
    RSV19_IRQn,             /* 0x23  0x008C  35: Reserved */
    RSV20_IRQn,             /* 0x24  0x0090  36: Reserved */
    RSV21_IRQn,             /* 0x25  0x0094  37: Reserved */
    RSV22_IRQn,             /* 0x26  0x0098  38: Magstripe DSP */
    FLC0_IRQn,              /* 0x27  0x009C  39: Flash Controller 0 */
    GPIO0_IRQn,             /* 0x28  0x00A0  40: GPIO0 */
    GPIO1_IRQn,             /* 0x29  0x00A4  41: GPIO2 */
    RSV26_IRQn,             /* 0x2A  0x00A8  42: Reserved */
    RSV27_IRQn,             /* 0x2B  0x00AC  43: Reserved */
    DMA0_IRQn,              /* 0x2C  0x00B0  44: DMA0 */
    DMA1_IRQn,              /* 0x2D  0x00B4  45: DMA1 */
    DMA2_IRQn,              /* 0x2E  0x00B8  46: DMA2 */
    DMA3_IRQn,              /* 0x2F  0x00BC  47: DMA3 */
    RSV32_IRQn,             /* 0x30  0x00C0  48: Reserved */
    RSV33_IRQn,             /* 0x31  0x00C4  49: Reserved */
    UART2_IRQn,             /* 0x32  0x00C8  50: UART 2 */
    RSV35_IRQn,             /* 0x33  0x00CC  51: Contactless Link Control */
    I2C1_IRQn,              /* 0x34  0x00D0  52: I2C1 */
    RSV37_IRQn,             /* 0x35  0x00D4  53: Smart Card 1 */
    RSV38_IRQn,             /* 0x36  0x00D8  54: Reserved */
    RSV39_IRQn,             /* 0x37  0x00DC  55: Reserved */
    RSV40_IRQn,             /* 0x38  0x00E0  56: Reserved */
    RSV41_IRQn,             /* 0x39  0x00E4  57: Reserved */
    RSV42_IRQn,             /* 0x3A  0x00E8  58: Reserved */
    RSV43_IRQn,             /* 0x3B  0x00EC  59: Reserved */
    RSV44_IRQn,             /* 0x3C  0x00F0  60: Reserved */
    RSV45_IRQn,             /* 0x3D  0x00F4  61: Reserved */
    RSV46_IRQn,             /* 0x3E  0x00F8  62: Reserved */
    RSV47_IRQn,             /* 0x3F  0x00FC  63: Reserved */
    RSV48_IRQn,             /* 0x40  0x0100  64: Reserved */
    RSV49_IRQn,             /* 0x41  0x0104  65: Reserved */
    RSV50_IRQn,             /* 0x42  0x0108  66: Reserved */
    RSV51_IRQn,             /* 0x43  0x010C  67: Reserved */
    RSV52_IRQn,             /* 0x44  0x0110  68: Reserved */
    RSV53_IRQn,             /* 0x45  0x0114  69: Reserved */
    GPIOWAKE_IRQn,          /* 0x46  0x0118  70: GPIOWAKE */
    RSV55_IRQn,             /* 0x47  0x011C  71: Reserved */
    RSV56_IRQn,             /* 0x48  0x0120  72: Reserved */
    WDT1_IRQn,              /* 0x49  0x0124  73: Watchdog 1 */
    RSV57_IRQn,             /* 0x4A  0x0128  74: Reserved */
    RSV58_IRQn,             /* 0x4B  0x012C  75: Reserved */
    RSV59_IRQn,             /* 0x4C  0x0130  76: Reserved */
    RSV61_IRQn,             /* 0x4D  0x0134  77: Reserved */
    I2C2_IRQn,              /* 0x4E  0x0138  78: I2C 2 */
    RSV63_IRQn,             /* 0x4F  0x013C  79: Reserved */
    RSV64_IRQn,             /* 0x50  0x0140  80: Reserved */
    RSV65_IRQn,             /* 0x51  0x0144  81: Reserved */
    RSV66_IRQn,             /* 0x52  0x0148  82: Reserved */
    RSV67_IRQn,             /* 0x53  0x014C  83: One Wire Master */
    DMA4_IRQn,              /* 0x54  0x0150  84: DMA4 */
    DMA5_IRQn,              /* 0x55  0x0154  85: DMA5 */
    DMA6_IRQn,              /* 0x56  0x0158  86: DMA6 */
    DMA7_IRQn,              /* 0x57  0x015C  87: DMA7 */
    DMA8_IRQn,              /* 0x58  0x0160  88: DMA8 */
    DMA9_IRQn,              /* 0x59  0x0164  89: DMA9 */
    DMA10_IRQn,             /* 0x5A  0x0168  90: DMA10 */
    DMA11_IRQn,             /* 0x5B  0x016C  91: DMA11 */
    DMA12_IRQn,             /* 0x5C  0x0170  92: DMA12 */
    DMA13_IRQn,             /* 0x5D  0x0174  93: DMA13 */
    DMA14_IRQn,             /* 0x5E  0x0178  94: DMA14 */
    DMA15_IRQn,             /* 0x5F  0x017C  95: DMA15 */
    RSV80_IRQn,             /* 0x60  0x0180  96: Reserved */
    RSV81_IRQn,             /* 0x61  0x0184  97: Reserved */
    ECC_IRQn,               /* 0x62  0x0188  98: Error Correction */
    RSV83_IRQn,             /* 0x63  0x018C  99: Reserved */
    RSV84_IRQn,             /* 0x64  0x0190  100: Reserved */
    RSV85_IRQn,             /* 0x65  0x0194  101: Reserved */
    RSV86_IRQn,             /* 0x66  0x0198  102: Reserved */
    RSV87_IRQn,             /* 0x67  0x019C  103: Reserved */
    UART3_IRQn,             /* 0x68  0x01A0  104: UART 3 */
    RSV89_IRQn,             /* 0x69  0x01A4  105: Reserved */
    RSV90_IRQn,             /* 0x6A  0x01A8  106: Reserved */
    RSV91_IRQn,             /* 0x6B  0x01AC  107: Reserved */
    RSV92_IRQn,             /* 0x6C  0x01B0  108: Reserved */
    RSV93_IRQn,           	/* 0x6D  0x01B4  109: Reserved */
    RSV94_IRQn,           	/* 0x6E  0x01B8  110: Reserved */
    RSV95_IRQn,           	/* 0x6F  0x01BC  111: Reserved */
    RSV96_IRQn,           	/* 0x70  0x01C0  112: Reserved */
    AES_IRQn,           	/* 0x71  0x01C4  113: AES */
    CRC_IRQn,           	/* 0x72  0x01C8  114: CRC */
    I2S_IRQn,           	/* 0x73  0x01CC  115: I2S */    
    MXC_IRQ_EXT_COUNT,
} IRQn_Type;

