ARMmbed/mbed-os/targets/TARGET_Maxim/TARGET_MAX32670/Libraries/CMSIS/Device/Maxim/MAX32670/Include/max32670.h
#define MXC_GPIO_GET_IDX(p)             ((p) == MXC_GPIO0 ? 0 :                \
                                            (p) == MXC_GPIO1 ? 1 : -1)

#define MXC_GPIO_GET_GPIO(i)            ((i) == 0 ? MXC_GPIO0 :                \
                                            (i) == 1 ? MXC_GPIO1 : 0)

#define MXC_GPIO_GET_IRQ(i)             ((i) == 0 ? GPIO0_IRQn :               \
                                            (i) == 1 ? GPIO1_IRQn : 0)

/******************************************************************************/
  



#define SEC(s)            (((unsigned long)s) * 1000000UL) 
#define MSEC(ms)          (ms * 1000UL)
#define USEC(us)          (us)
/*                                                                      Timer */
#define MXC_CFG_TMR_INSTANCES           (6)

#define MXC_BASE_TMR0                   ((uint32_t)0x40010000UL)
#define MXC_TMR0                        ((mxc_tmr_regs_t*)MXC_BASE_TMR0)
#define MXC_BASE_TMR1                   ((uint32_t)0x40011000UL)
#define MXC_TMR1                        ((mxc_tmr_regs_t*)MXC_BASE_TMR1)
#define MXC_BASE_TMR2                   ((uint32_t)0x40012000UL)
#define MXC_TMR2                        ((mxc_tmr_regs_t*)MXC_BASE_TMR2)
#define MXC_BASE_TMR3                   ((uint32_t)0x40013000UL)
#define MXC_TMR3                        ((mxc_tmr_regs_t*)MXC_BASE_TMR3)
#define MXC_BASE_TMR4                   ((uint32_t)0x40114000UL)
#define MXC_TMR4                        ((mxc_tmr_regs_t*)MXC_BASE_TMR4)
#define MXC_BASE_TMR5                   ((uint32_t)0x40115000UL)
#define MXC_TMR5                        ((mxc_tmr_regs_t*)MXC_BASE_TMR5)

#define MXC_TMR_GET_IRQ(i)              (IRQn_Type)((i) == 0 ? TMR0_IRQn :     \
                                            (i) == 1 ? TMR1_IRQn :             \
                                            (i) == 2 ? TMR2_IRQn :             \
                                            (i) == 3 ? TMR3_IRQn :             \
                                            (i) == 4 ? TMR4_IRQn :             \
                                            (i) == 5 ? TMR5_IRQn : 0)

#define MXC_TMR_GET_BASE(i)             ((i) == 0 ? MXC_BASE_TMR0 :            \
                                            (i) == 1 ? MXC_BASE_TMR1 :         \
                                            (i) == 2 ? MXC_BASE_TMR2 :         \
                                            (i) == 3 ? MXC_BASE_TMR3 :         \
                                            (i) == 4 ? MXC_BASE_TMR4 :         \
                                            (i) == 5 ? MXC_BASE_TMR5 : 0)

#define MXC_TMR_GET_TMR(i)              ((i) == 0 ? MXC_TMR0 :                 \
                                            (i) == 1 ? MXC_TMR1 :              \
                                            (i) == 2 ? MXC_TMR2 :              \
                                            (i) == 3 ? MXC_TMR3 :              \
                                            (i) == 4 ? MXC_TMR4 :              \
                                            (i) == 5 ? MXC_TMR5 : 0)

#define MXC_TMR_GET_IDX(p)              ((p) == MXC_TMR0 ? 0 :                 \
                                            (p) == MXC_TMR1 ? 1 :              \
                                            (p) == MXC_TMR2 ? 2 :              \
                                            (p) == MXC_TMR3 ? 3 :              \
                                            (p) == MXC_TMR4 ? 4 :              \
                                            (p) == MXC_TMR5 ? 5 : -1)

/******************************************************************************/
/*                                                                        I2C */
#define MXC_I2C_INSTANCES               (3)

#define MXC_BASE_I2C0                   ((uint32_t)0x4001D000UL)
#define MXC_I2C0                        ((mxc_i2c_regs_t*)MXC_BASE_I2C0)
#define MXC_BASE_I2C1                   ((uint32_t)0x4001E000UL)
#define MXC_I2C1                        ((mxc_i2c_regs_t*)MXC_BASE_I2C1)
#define MXC_BASE_I2C2                   ((uint32_t)0x4001F000UL)
#define MXC_I2C2                        ((mxc_i2c_regs_t*)MXC_BASE_I2C2)


#define MXC_I2C_GET_IRQ(i)              (IRQn_Type)((i) == 0 ? I2C0_IRQn :     \
                                            (i) == 1 ? I2C1_IRQn :             \
                                            (i) == 2 ? I2C2_IRQn : 0)

#define MXC_I2C_GET_BASE(i)             ((i) == 0 ? MXC_BASE_I2C0 :            \
                                            (i) == 1 ? MXC_BASE_I2C1 :         \
                                            (i) == 2 ? MXC_BASE_I2C2 : 0)

#define MXC_I2C_GET_I2C(i)              ((i) == 0 ? MXC_I2C0 :                 \
                                            (i) == 1 ? MXC_I2C1 :              \
                                            (i) == 2 ? MXC_I2C2 : 0)

#define MXC_I2C_GET_IDX(p)              ((p) == MXC_I2C0 ? 0 :                 \
                                            (p) == MXC_I2C1 ? 1 :              \
                                            (p) == MXC_I2C2 ? 2 : -1)
#define MXC_I2C_FIFO_DEPTH              (8)


/******************************************************************************/
/*                                                                        DMA */
#define MXC_DMA_CHANNELS                (8)
#define MXC_DMA_INSTANCES               (1)

#define MXC_BASE_DMA                    ((uint32_t)0x40028000UL)
#define MXC_DMA                         ((mxc_dma_regs_t*)MXC_BASE_DMA)

#define MXC_DMA_GET_IDX(p)              ((p) == MXC_DMA ? 0 : -1)

/******************************************************************************/
/*                                                                        FLC */
#define MXC_FLC_INSTANCES               (1)

#define MXC_BASE_FLC0                   ((uint32_t)0x40029000UL)
#define MXC_FLC0                        ((mxc_flc_regs_t*)MXC_BASE_FLC0)


#define MXC_FLC_GET_IRQ(i)              (IRQn_Type)((i) == 0 ? FLC0_IRQn : 0)

