ARMmbed/mbed-os/targets/TARGET_Maxim/TARGET_MAX32670/Libraries/CMSIS/Device/Maxim/MAX32670/Include/max32670.h
#define MXC_FLC_GET_BASE(i)             ((i) == 0 ? MXC_BASE_FLC0 : 0)

#define MXC_FLC_GET_FLC(i)              ((i) == 0 ? MXC_FLC0 :  0)

#define MXC_FLC_GET_IDX(p)              ((p) == MXC_FLC0 ? 0 : -1)
/******************************************************************************/
/*                                                          Instruction Cache */

#define MXC_BASE_ICC                    ((uint32_t)0x4002A000UL)
#define MXC_ICC                         ((mxc_icc_regs_t*)MXC_BASE_ICC)

/******************************************************************************/
/*                                                                 Data Cache */
#define MXC_BASE_EMCC                   ((uint32_t)0x40033000UL)
#define MXC_EMCC                        ((mxc_emcc_regs_t*)MXC_BASE_EMCC)

/******************************************************************************/
/*                                                     XXX Actually reserved! */
#define MXC_BASE_RESERVED               ((uint32_t)0x40035000UL)

/******************************************************************************/
/*                                                            One Wire Master */
#define MXC_BASE_OWM                    ((uint32_t)0x4003D000UL)
#define MXC_OWM                         ((mxc_owm_regs_t*)MXC_BASE_OWM)

/******************************************************************************/
/*                                               UART / Serial Port Interface */

#define MXC_UART_INSTANCES              (4)
#define MXC_UART_FIFO_DEPTH             (8)

#define MXC_BASE_UART0                  ((uint32_t)0x40042000UL)
#define MXC_UART0                       ((mxc_uart_regs_t*)MXC_BASE_UART0)
#define MXC_BASE_UART1                  ((uint32_t)0x40043000UL)
#define MXC_UART1                       ((mxc_uart_regs_t*)MXC_BASE_UART1)
#define MXC_BASE_UART2                  ((uint32_t)0x40044000UL)
#define MXC_UART2                       ((mxc_uart_regs_t*)MXC_BASE_UART2)
#define MXC_BASE_UART3                  ((uint32_t)0x40145000UL)
#define MXC_UART3                       ((mxc_uart_regs_t*)MXC_BASE_UART3)

#define MXC_UART_GET_IRQ(i)             (IRQn_Type)((i) == 0 ? UART0_IRQn :    \
                                            (i) == 1 ? UART1_IRQn :            \
                                            (i) == 2 ? UART2_IRQn :            \
                                            (i) == 3 ? UART3_IRQn :  0)

#define MXC_UART_GET_BASE(i)            ((i) == 0 ? MXC_BASE_UART0 :           \
                                            (i) == 1 ? MXC_BASE_UART1 :        \
                                            (i) == 2 ? MXC_BASE_UART2 :        \
                                            (i) == 3 ? MXC_BASE_UART3 : 0)

#define MXC_UART_GET_UART(i)            ((i) == 0 ? MXC_UART0 :                \
                                            (i) == 1 ? MXC_UART1 :             \
                                            (i) == 2 ? MXC_UART2 :             \
                                            (i) == 3 ? MXC_UART3 : 0)

#define MXC_UART_GET_IDX(p)             ((p) == MXC_UART0 ? 0 :                \
                                            (p) == MXC_UART1 ? 1 :             \
                                            (p) == MXC_UART2 ? 2 :               \
                                            (p) == MXC_UART3 ? 3 : -1)
 
/******************************************************************************/
/*                                                                        SPI */

#define MXC_SPI_INSTANCES               (3)
#define MXC_SPI_SS_INSTANCES            (4)
#define MXC_SPI_FIFO_DEPTH              (32)

#define MXC_BASE_SPI0                   ((uint32_t)0x40046000UL)
#define MXC_SPI0                        ((mxc_spi_regs_t*)MXC_BASE_SPI0)
#define MXC_BASE_SPI1                   ((uint32_t)0x40047000UL)
#define MXC_SPI1                        ((mxc_spi_regs_t*)MXC_BASE_SPI1)
#define MXC_BASE_SPI2                   ((uint32_t)0x40048000UL)
#define MXC_SPI2                        ((mxc_spi_regs_t*)MXC_BASE_SPI2)



#define MXC_SPI_GET_IDX(p)              ((p) == MXC_SPI0 ? 0 :              \
                                          (p) == MXC_SPI1 ? 1 :              \
                                          (p) == MXC_SPI2 ? 2 :	 -1)

#define MXC_SPI_GET_BASE(i)             ((i) == 0 ? MXC_BASE_SPI0 :         \
                                          (i) == 1 ? MXC_BASE_SPI1 :         \
                                          (i) == 2 ? MXC_BASE_SPI2 : 0)

#define MXC_SPI_GET_SPI(i)              ((i) == 0 ? MXC_SPI0 :              \
                                          (i) == 1 ? MXC_SPI1 :              \
                                          (i) == 2 ? MXC_SPI2 : 0)

#define MXC_SPI_GET_IRQ(i)              (IRQn_Type)((i) == 0 ? SPI0_IRQn :   \
                                          (i) == 1 ? SPI1_IRQn :             \
                                          (i) == 2 ? SPI2_IRQn : 0)


/******************************************************************************/
/*                                                                       TRNG */
#define MXC_BASE_TRNG                   ((uint32_t)0x4004D000UL)
#define MXC_TRNG                        ((mxc_trng_regs_t*)MXC_BASE_TRNG)

/******************************************************************************/
/*                                                                        AES */
#define MXC_BASE_AES                    ((uint32_t)0x40007400UL)
#define MXC_AES                         ((mxc_aes_regs_t*)MXC_BASE_AES)

/******************************************************************************/
/*                                                                   AES Keys */
#define MXC_BASE_AESKEY                 ((uint32_t)0x40005000UL)
#define MXC_AESKEY                      ((mxc_aes_key_regs_t*)MXC_BASE_AESKEY)

/******************************************************************************/
/*                                                                        CRC */
#define MXC_BASE_CRC                    ((uint32_t)0x4000F000UL)
#define MXC_CRC                         ((mxc_crc_regs_t*)MXC_BASE_CRC)

/******************************************************************************/
#define MXC_BASE_I2S                    ((uint32_t)0x40060000UL)
#define MXC_I2S                         ((mxc_i2s_regs_t*)MXC_BASE_I2S)

/******************************************************************************/
/*                                                                       BBFC */
#define MXC_BASE_BBFC                   ((uint32_t)0x40005800UL)
#define MXC_BBFC                        ((mxc_bbfc_regs_t*)MXC_BASE_BBFC)


/******************************************************************************/
/*                                                               Bit Shifting */

#define MXC_F_BIT_0                     (1 << 0)
#define MXC_F_BIT_1                     (1 << 1)
#define MXC_F_BIT_2                     (1 << 2)
#define MXC_F_BIT_3                     (1 << 3)
#define MXC_F_BIT_4                     (1 << 4)
#define MXC_F_BIT_5                     (1 << 5)
#define MXC_F_BIT_6                     (1 << 6)
#define MXC_F_BIT_7                     (1 << 7)
#define MXC_F_BIT_8                     (1 << 8)
#define MXC_F_BIT_9                     (1 << 9)
#define MXC_F_BIT_10                    (1 << 10)
#define MXC_F_BIT_11                    (1 << 11)
#define MXC_F_BIT_12                    (1 << 12)
#define MXC_F_BIT_13                    (1 << 13)
#define MXC_F_BIT_14                    (1 << 14)
#define MXC_F_BIT_15                    (1 << 15)
#define MXC_F_BIT_16                    (1 << 16)
#define MXC_F_BIT_17                    (1 << 17)
#define MXC_F_BIT_18                    (1 << 18)
#define MXC_F_BIT_19                    (1 << 19)
#define MXC_F_BIT_20                    (1 << 20)
#define MXC_F_BIT_21                    (1 << 21)
#define MXC_F_BIT_22                    (1 << 22)
#define MXC_F_BIT_23                    (1 << 23)
#define MXC_F_BIT_24                    (1 << 24)
#define MXC_F_BIT_25                    (1 << 25)
#define MXC_F_BIT_26                    (1 << 26)
#define MXC_F_BIT_27                    (1 << 27)
#define MXC_F_BIT_28                    (1 << 28)
#define MXC_F_BIT_29                    (1 << 29)
#define MXC_F_BIT_30                    (1 << 30)
#define MXC_F_BIT_31                    (1 << 31)

/******************************************************************************/
/*                                                               Bit Banding  */


#define BITBAND(reg, bit)               ((0xf0000000 & (uint32_t)(reg)) + 0x2000000 + \
                                            (((uint32_t)(reg) & 0x0fffffff) << 5) + ((bit) << 2))

#define MXC_CLRBIT(reg, bit)            (*(volatile uint32_t *)BITBAND(reg, bit) = 0)
#define MXC_SETBIT(reg, bit)            (*(volatile uint32_t *)BITBAND(reg, bit) = 1)
#define MXC_GETBIT(reg, bit)            (*(volatile uint32_t *)BITBAND(reg, bit))

#define MXC_SETFIELD(reg, mask, setting)  (reg = (reg & ~mask) | (setting & mask))

/******************************************************************************/
/*                                                                  SCB CPACR */

/* Note: Added by Maxim Integrated, as these are missing from CMSIS/Core/Include/core_cm4.h */
#define SCB_CPACR_CP10_Pos              20                              /*!< SCB CPACR: Coprocessor 10 Position */
#define SCB_CPACR_CP10_Msk              (0x3UL << SCB_CPACR_CP10_Pos)   /*!< SCB CPACR: Coprocessor 10 Mask */
#define SCB_CPACR_CP11_Pos              22                              /*!< SCB CPACR: Coprocessor 11 Position */
#define SCB_CPACR_CP11_Msk              (0x3UL << SCB_CPACR_CP11_Pos)   /*!< SCB CPACR: Coprocessor 11 Mask */

#endif  /* _MAX32670_REGS_H_ */
